app/controllers/api/events_controller.rb

SELECT "event_instruments".* FROM "event_instruments" WHERE "event_instruments"."event_id" = $1  [["event_id", 1]]
SELECT "events".* FROM "events"
SELECT "instruments".* FROM "instruments" INNER JOIN "event_instruments" ON "instruments"."id" = "event_instruments"."instrument_id" WHERE "event_instruments"."event_id" = $1  [["event_id", 1]]
---
  def index
    @events = Event.with_attached_event_image.includes([:user, :event_instruments, :instruments]).all

SELECT "instruments".* FROM "instruments" INNER JOIN "event_instruments" ON "instruments"."id" = "event_instruments"."instrument_id" WHERE "event_instruments"."event_id" = $1  [["event_id", 1]]
---
  def search
    @events = Event.with_attached_event_image.joins(:instruments)
    .where(instruments: { name: params[:instrument] })
    .where('city = ? AND level = ? AND genre = ?', params[:city], params[:level], params[:genre])

SELECT "events".* FROM "events" WHERE (city = 'Toronto' )
---
  def set_event
    @event = Event.find(params[:id])