app/controllers/api/notes_controller.rb

  def index
    render json: Note.all
---
SELECT "notes".* FROM "notes"