app/controllers/api/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "johnsmith@test.com"], ["LIMIT", 1]]
---
    def create
        user = User.find_by_email(user_params[:email])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def logged_in
        @current_user ||= User.find_by(id: session[:user_id]) if session[:user_id]